000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/БезопасноеХранилищеДанных/БезопасноеХранилищеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилищеДанных</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>Мигрировать</name>
    <comment>Если нет, то остается в том узле, где создано</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>ExchangePlanRef</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/БезопасноеХранилищеДанных/ManagerModule.bsl
//	LNK 22.07.2019 14:24:24
Процедура ДанныеЗаписать(Владелец, Данные, Магазин, Мигрировать = Истина)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Владелец    = Владелец;
	МенеджерЗаписи.Данные      = ?(ТипЗнч(Данные) = Тип("ХранилищеЗначения"), Данные, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	МенеджерЗаписи.Магазин     = Магазин;
	МенеджерЗаписи.Мигрировать = Мигрировать;

	МенеджерЗаписи.Записать();

КонецПроцедуры

//	LNK 22.07.2019 14:47:25
Функция ДанныеПрочитать(Владелец)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Владелец = Владелец;

	МенеджерЗаписи.Прочитать();

	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Данные, Новый ХранилищеЗначения(Неопределено));

КонецФункции
